; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_2 type_1)
 (:predicates (pred_1 ?v4 - type_2 ?v1 - type_3)
 	      (pred_2 ?v8 - object ?v1 - type_3)
	      (pred_3 ?v4 - type_2 ?v7 - type_1)
	      (pred_4 ?v4 - type_2 ?v8 - object ?v7 - type_1))

   (:action op_3
       :parameters  (?v4 - type_2 ?v3 ?v2 - type_3)
       :precondition (and  (pred_1 ?v4 ?v3))
       :effect (and  (pred_1 ?v4 ?v2)
		     (not (pred_1 ?v4 ?v3))))

   (:action op_2
       :parameters (?v4 - type_2 ?v5 - object ?v6 - type_3 ?v7 - type_1)
       :precondition  (and  (pred_2 ?v5 ?v6) (pred_1 ?v4 ?v6) (pred_3 ?v4 ?v7))
       :effect (and (pred_4 ?v4 ?v5 ?v7)
		    (not (pred_2 ?v5 ?v6)) 
		    (not (pred_3 ?v4 ?v7))))

   (:action op_1
       :parameters (?v4 - type_2 ?v5 - object ?v6 - type_3 ?v7 - type_1)
       :precondition  (and  (pred_4 ?v4 ?v5 ?v7) (pred_1 ?v4 ?v6))
       :effect (and (pred_2 ?v5 ?v6)
		    (pred_3 ?v4 ?v7)
		    (not (pred_4 ?v4 ?v5 ?v7)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_07 obj_09 - type_2
obj_10 obj_08 obj_05 obj_06 - type_1
obj_04 obj_13 obj_01 obj_02 - type_3
obj_12 obj_14 obj_11 obj_03 - object)
(:init
(pred_1 obj_07 obj_13)
(pred_3 obj_07 obj_10)
(pred_3 obj_07 obj_08)
(pred_1 obj_09 obj_02)
(pred_3 obj_09 obj_05)
(pred_3 obj_09 obj_06)
(pred_2 obj_12 obj_02)
(pred_2 obj_14 obj_02)
(pred_2 obj_11 obj_04)
(pred_2 obj_03 obj_01)
)
(:goal
(and
(pred_2 obj_12 obj_02)
(pred_2 obj_14 obj_01)
(pred_2 obj_11 obj_04)
(pred_2 obj_03 obj_04)
)
)

(:constraints
  (and
    (always (not (and (pred_1 obj_07 obj_01) (pred_1 obj_09 obj_01))))
  )
)
)

; plan
1. (op_2 obj_09 obj_14 obj_02 obj_06)
   deleted: (pred_2 obj_14 obj_02) (pred_3 obj_09 obj_06)
   added: (pred_4 obj_09 obj_14 obj_06)
   goals met: 2 of 4
2. (op_3 obj_07 obj_13 obj_04)
   deleted: (pred_1 obj_07 obj_13)
   added: (pred_1 obj_07 obj_04)
   goals met: 2 of 4
3. (op_3 obj_09 obj_02 obj_01)
   deleted: (pred_1 obj_09 obj_02)
   added: (pred_1 obj_09 obj_01)
   goals met: 2 of 4
4. (op_1 obj_09 obj_14 obj_01 obj_06)
   deleted: (pred_4 obj_09 obj_14 obj_06)
   added: (pred_2 obj_14 obj_01) (pred_3 obj_09 obj_06)
   goals met: 3 of 4
5. (op_2 obj_09 obj_03 obj_01 obj_05)
   deleted: (pred_2 obj_03 obj_01) (pred_3 obj_09 obj_05)
   added: (pred_4 obj_09 obj_03 obj_05)
   goals met: 3 of 4
6. (op_3 obj_09 obj_01 obj_04)
   deleted: (pred_1 obj_09 obj_01)
   added: (pred_1 obj_09 obj_04)
   goals met: 3 of 4
7. (op_1 obj_09 obj_03 obj_04 obj_05)
   deleted: (pred_4 obj_09 obj_03 obj_05)
   added: (pred_2 obj_03 obj_04) (pred_3 obj_09 obj_05)
   goals met: 4 of 4
